Documents/programming/flutter/flutter_backend/app/controllers/application_controller.rb

  def retrieve_direct_thread(directMessageID)
    @m_user = MUser.find_by(id: @userid)
     @s_user = MUser.find_by(id: 2)
     @t_direct_message = TDirectMessage.find_by(id: directMessageID)
     @send_user = MUser.find_by(id: @t_direct_message.send_user_id)
     TDirectThread.where.not(m_user_id: @m_user, read_status: 1).update_all(read_status: 1)
     @t_direct_threads = TDirectThread.select("name, directthreadmsg, t_direct_threads.id as id, t_direct_threads.created_at  as created_at")
                 .joins("INNER JOIN t_direct_messages ON t_direct_messages.id = t_direct_threads.t_direct_message_id
                         INNER JOIN m_users ON m_users.id = t_direct_threads.m_user_id")
                 .where("t_direct_threads.t_direct_message_id = ?", directMessageID).order(id: :asc)
     @temp_direct_star_thread_msgids = TDirectStarThread.select("directthreadid").where("userid = ?", @m_user)
     @t_direct_star_thread_msgids = Array.new
     @temp_direct_star_thread_msgids.each { |r| @t_direct_star_thread_msgids.push(r.directthreadid) }
---
SELECT `m_users`.* FROM `m_users` WHERE `m_users`.`id` IS NULL LIMIT 1
SELECT `m_users`.* FROM `m_users` WHERE `m_users`.`id` = 2 LIMIT 1
SELECT `t_direct_messages`.* FROM `t_direct_messages` WHERE `t_direct_messages`.`id` = 1 LIMIT 1
UPDATE `t_direct_threads` SET `t_direct_threads`.`read_status` = TRUE WHERE NOT (`t_direct_threads`.`m_user_id` IS NULL AND `t_direct_threads`.`read_status` = TRUE)
SELECT `t_direct_star_threads`.`directthreadid` FROM `t_direct_star_threads` WHERE (userid = NULL)

  def authenticate_request
    header = request.headers["Authorization"]

    if header.present?
      header = header.split.last # Remove unnecessary split("").last
      begin
        decoded = jwt_decode(header)
        @current_user = MUser.find(decoded[:user_id])
---
SELECT `m_users`.* FROM `m_users` WHERE `m_users`.`id` = 3 LIMIT 1