Documents/programming/flutter/flutter_backend/app/controllers/m_users_controller.rb

SELECT `m_users`.* FROM `m_users` WHERE `m_users`.`name` = 'cmm' LIMIT 1
SELECT `m_workspaces`.* FROM `m_workspaces` INNER JOIN t_user_workspaces ON t_user_workspaces.workspaceid = m_workspaces.id
SELECT `t_user_workspaces`.* FROM `t_user_workspaces` WHERE `t_user_workspaces`.`userid` = 3 AND `t_user_workspaces`.`workspaceid` = 2 LIMIT 1
---
  def login_user
    m_user = MUser.find_by(name: login_params[:name])
    m_workspace = MWorkspace.joins("INNER JOIN t_user_workspaces ON t_user_workspaces.workspaceid = m_workspaces.id
                                    INNER JOIN m_users ON m_users.id = t_user_workspaces.userid")
                            .where("m_workspaces.workspace_name = ? and m_users.name = ? ", login_params[:workspace_name],  login_params[:name]).take(1)

    if m_user && m_user.authenticate(login_params[:password]) && m_workspace.size > 0
      t_user_workspace = TUserWorkspace.find_by(userid: m_user.id, workspaceid: m_workspace[0].id)

SELECT `m_workspaces`.* FROM `m_workspaces` WHERE `m_workspaces`.`id` IS NULL LIMIT 1
INSERT INTO `m_channels` (`channel_name`, `channel_status`, `m_workspace_id`, `created_at`, `updated_at`) VALUES ('Channel234', TRUE, 2, '2024-02-17 03:28:39', '2024-02-17 03:28:39')
INSERT INTO `m_workspaces` (`workspace_name`, `created_at`, `updated_at`) VALUES ('WorkspaceTest1', '2024-02-17 03:28:37', '2024-02-17 03:28:37')
INSERT INTO `m_users` (`name`, `email`, `password_digest`, `profile_image`, `remember_digest`, `active_status`, `admin`, `member_status`, `created_at`, `updated_at`) VALUES ('cmm', 'cmm124@gmail.com', '$2a$12$SkwtGAY2gIlQGQ8Nmf5lK.SnqUrGIcr470y7MLmUzNKTl09NsgMwC', 'Channel234', 'WorkspaceTest1', NULL, TRUE, TRUE, '2024-02-17 03:28:37', '2024-02-17 03:28:37')
SELECT `m_channels`.* FROM `m_channels` WHERE `m_channels`.`channel_name` = 'Channel23' AND `m_channels`.`m_workspace_id` IS NULL LIMIT 1
UPDATE `m_users` SET `m_users`.`remember_digest` = NULL, `m_users`.`profile_image` = NULL WHERE `m_users`.`id` = 3
---
  def create
    #check login user
    # checkloginuser

    @m_user = MUser.new(user_params)

    @m_workspace = MWorkspace.new
    @m_workspace.workspace_name = @m_user.remember_digest

    @m_channel = MChannel.new
    @m_channel.channel_name = @m_user.profile_image
    @m_channel.channel_status = 1

    @m_user.member_status = 1

    status = true

    @t_workspace = MWorkspace.find_by(id: session[:invite_workspaceid])

    if status &&  @m_user.save
      MUser.where(id: @m_user.id).update_all(remember_digest: nil, profile_image: nil)
    else
      status = false
    end

    if(@t_workspace.nil?)
      if status && @m_workspace.save

INSERT INTO `t_user_workspaces` (`userid`, `workspaceid`, `created_at`, `updated_at`) VALUES (3, 2, '2024-02-17 03:28:38', '2024-02-17 03:28:38')
---
    @t_user_workspace.userid = @m_user.id
    @t_user_workspace.workspaceid = @m_workspace.id

    if status && @t_user_workspace.save

SELECT `m_channels`.* FROM `m_channels` WHERE `m_channels`.`channel_name` = 'Channel23' AND `m_channels`.`m_workspace_id` IS NULL LIMIT 1
INSERT INTO `t_user_channels` (`message_count`, `unread_channel_message`, `created_admin`, `userid`, `channelid`, `created_at`, `updated_at`) VALUES (0, '0', TRUE, 3, 2, '2024-02-17 03:28:39', '2024-02-17 03:28:39')
INSERT INTO `m_channels` (`channel_name`, `channel_status`, `m_workspace_id`, `created_at`, `updated_at`) VALUES ('Channel234', TRUE, 2, '2024-02-17 03:28:39', '2024-02-17 03:28:39')
---

    @t_user_channel = TUserChannel.new

    @t_channel = MChannel.find_by(channel_name: @m_channel.channel_name, m_workspace_id: @m_workspace.id)

    if(@t_channel.nil?)
      @t_user_channel.created_admin = 1
      @m_channel.m_workspace_id = @m_workspace.id

      if status && @m_channel.save

INSERT INTO `t_user_channels` (`message_count`, `unread_channel_message`, `created_admin`, `userid`, `channelid`, `created_at`, `updated_at`) VALUES (0, '0', TRUE, 3, 2, '2024-02-17 03:28:39', '2024-02-17 03:28:39')
---
    @t_user_channel.userid = @m_user.id
    @t_user_channel.channelid = @m_channel.id

    if status && @t_user_channel.save

SELECT `m_users`.* FROM `m_users` WHERE `m_users`.`id` = 2 LIMIT 1
---
  def show
    @m_user = MUser.find_by(id: params[:id])