Documents/programming/flutter/flutter_backend/app/controllers/member_invitation_controller.rb

  def invite
    #check unlogin user
    # checkuser
    # puts params[:email].nil?
    # puts params[:channel_id].nil?
    # puts params[:workspace_id]
    @user = MUser.joins("INNER JOIN t_user_workspaces ON t_user_workspaces.userid = m_users.id").where("t_user_workspaces.workspaceid = ? and m_users.email = ?", invite_params[:workspace_id], invite_params[:email])
    if @user.size > 0
      render json: { error: "Email Is Already Member." }, status: :unprocessable_entity
    else
      if invite_params[:channel_id].nil? || invite_params[:channel_id] == ""
        render json: { error: "Please Select Channel." }, status: :unprocessable_entity
      elsif invite_params[:email].nil? || invite_params[:email] == ""
        render json: { error: "Please Enter Email." }, status: :unprocessable_entity
      else
        @i_user = MUser.new
        @i_user.email = invite_params[:email]
        @i_channel = MChannel.find_by(id: invite_params[:channel_id])
        @i_workspace = MWorkspace.find_by(id: invite_params[:workspace_id])
---
SELECT COUNT(*) FROM `m_users` INNER JOIN t_user_workspaces ON t_user_workspaces.userid = m_users.id WHERE (t_user_workspaces.workspaceid = '2' and m_users.email = 'thantsinphyoe18920@gmail.com')
SELECT `m_channels`.* FROM `m_channels` WHERE `m_channels`.`id` = 2 LIMIT 1
SELECT `m_workspaces`.* FROM `m_workspaces` WHERE `m_workspaces`.`id` = 2 LIMIT 1