Documents/programming/flutter/flutter_backend/app/views/mention_lists/show.json.jbuilder

SELECT t_group_threads.id,t_group_threads.groupthreadmsg,t_group_threads.created_at,m_users.name,m_channels.channel_name FROM `t_group_threads` INNER JOIN t_group_mention_threads ON t_group_threads.id=t_group_mention_threads.groupthreadid
---
    json.id t_group_thread.id
    json.groupthreadmsg t_group_thread.groupthreadmsg