Documents/programming/flutter/flutter_backend/app/views/thread/show.json.jbuilder

SELECT m_users.name, t_group_threads.groupthreadmsg, t_group_threads.id, t_group_threads.t_group_message_id,t_group_threads.created_at FROM `t_group_threads` INNER JOIN t_group_messages ON t_group_messages.id = t_group_threads.t_group_message_id
---
    json.name t_group_thread.name
    json.groupthreadmsg t_group_thread.groupthreadmsg